Конфигурация/Catalogs/Векселя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Векселя</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Эмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Эмитенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номинал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаНоминала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВекселя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВекселей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентГодовых</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПогашения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПогашенияВекселей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейДоПогашения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоставления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПогашения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаНачисленияПроцентов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПогаситьНеПозднее</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетныйАктивЦБРФ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторУчетныхАктивовЦБРФ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/InformationRegisters/УсловияРасчетаПроцентовВекселей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияРасчетаПроцентовВекселей</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НастройкаРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Вексель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Векселя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ТипыВекселей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыВекселей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дисконтный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Процентный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Catalogs/Векселя/Ext/ManagerModule.bsl
Функция ПолучитьПроцентГодовых(Вексель, Период) Экспорт
	
	Если Вексель.ТипВекселя <> Перечисления.ТипыВекселей.Процентный Тогда
		ВызватьИсключение "Получение процента годовых предусмотрено только для процентных векселей";
	КонецЕсли;
	
	ПроцентГодовых = 0;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Вексель", Вексель);
	Запрос.УстановитьПараметр("Период",  Период);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Векселя.ПроцентГодовых КАК ПроцентГодовых,
		|	УсловияРасчетаПроцентовВекселейСрезПоследних.НастройкаРасчета КАК НастройкаРасчета
		|ИЗ
		|	Справочник.Векселя КАК Векселя
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияРасчетаПроцентовВекселей.СрезПоследних(&Период, Вексель = &Вексель) КАК УсловияРасчетаПроцентовВекселейСрезПоследних
		|		ПО Векселя.Ссылка = УсловияРасчетаПроцентовВекселейСрезПоследних.Вексель
		|ГДЕ
		|	Векселя.Ссылка = &Вексель";
	
	ДанныеВекселя = Запрос.Выполнить().Выбрать();
	ДанныеВекселя.Следующий();
	
	Если НЕ ЗначениеЗаполнено(ДанныеВекселя.НастройкаРасчета) И НЕ ЗначениеЗаполнено(ДанныеВекселя.ПроцентГодовых) Тогда
		ВызватьИсключение СтрШаблон("Для векселя %1 не указан процент годовых и не заданы условия расчёта процента", Вексель);
		
	ИначеЕсли ЗначениеЗаполнено(ДанныеВекселя.НастройкаРасчета) И ЗначениеЗаполнено(ДанныеВекселя.ПроцентГодовых) Тогда
		ВызватьИсключение СтрШаблон("Для векселя %1 указан процент годовых и заданы условия расчёта процента. Нет возможности однозначно определить процент по векселю.", Вексель);
		
	ИначеЕсли ЗначениеЗаполнено(ДанныеВекселя.ПроцентГодовых) Тогда 
		ПроцентГодовых = ДанныеВекселя.ПроцентГодовых;
		
	Иначе
		ПроцентГодовых = Справочники.НастройкиРасчета.Рассчитать(ДанныеВекселя.НастройкаРасчета, Новый Структура("Период", Период));
		
	КонецЕсли;
	
	Возврат ПроцентГодовых;
	
КонецФункции
